// 영화정보객체 JS : JS4-1.배열과객체_object.js

//ㄱㄱ
var motoraObj = {
    // 1.영화제목
    제목:"레미제라블",
    // 2. 감독
    감독:"톰 후퍼",
    // 3. 배우
    배우:"휴 잭맨, 러셀 크로우",
    // 4. 장르
    장르:"드라마, 뮤지컬, 로맨스",
    // 5. 관람가
    관람가:"12세 이상 관람가",
    // 6. 예고편
    예고편: function(){
        // 1. 호출확인
        // alert("예고편");

        // 플레이함수 호출
        playMv("Qei594KgLgM");
    } // 예고편 메서드 //
}; // motoraObj 객체 // 

// ㄴㄴ
var myV = {
    // 1. 영화제목
    제목:"인터스텔라",
    // 2. 감독
    감독:"크리스토퍼 놀란",
    // 3. 배우
    배우:"매튜 매커너히,앤 해서웨이",
    // 4. 장르
    장르:"SF,드라마",
    // 5. 관람가
    관람가:"12세 이상 관람가",
    // 6. 예고편
    예고편: function(){
      // 1. 호출확인
      // alert("예고편");

      // 플레이함수 호출
      playMv("d2VN6NNa9BE");
      
      
    } ////// 예고편 메서드 //////
  }; /////////// myV 객체 /////////////

  // ㄷㄷ
  var GSObj = {
    // 1.영화제목
    제목:"교섭",
    // 2. 감독
    감독:"임순례",
    // 3. 배우
    배우:"황정민, 현빈",
    // 4. 장르
    장르:"전쟁, 드라마",
    // 5. 관람가
    관람가:"15000",
    // 6. 예고편
    예고편:function(){
        // 호출확인
        // alert("예고편");

        // 플레이어 호출
        playMv("kJnmT5BS4SA");

    }////////////// 예고편메서드 ///////////////////

}//////////////// GSObj객체 ////////////////////////

// ㄹㄹ
var mjObj = {
    // 1.영화제목
    제목:"영웅",
    // 2. 감독
    감독:"윤제균",
    // 3. 배우
    배우:"정성화, 김고은, 나문희, 조재윤",
    // 4. 장르
    장르:"드라마",
    // 5. 관람가
    관람가:"전체",
    // 6. 예고편
    예고편: function(){
        // 1. 호출확인
        // alert(" 예고편");

        // 플레이함수 호출
        playMv("K4KR4J-yBMw");
        
    } ////////////// 예고편 ///////////////
}; //////////////////// mjObj 객체 ///////////////////////

// ㅁㅁ
var somObj = {
    // 1. 영화제목
    제목:"젠틀맨",
    // 2. 감독
    감독:"김경원",
    // 3. 배우
    배우:"주지훈,박성웅,최성은",
    // 4. 장르
    장르:"범죄",
    // 5. 관람가
    관람가:"15세 관람가",
    // 6. 예고편
    예고편: function(){
        // 1. 호출확인
        // alert("예고편");

        // 플레이함수 호출
        playMv("LL2uXeYeM-4");

    } ///////////////// 예고편 메서드
}; ///////////////////////////////// somObj 객체



